#ifndef H_LANG_RU
#define H_LANG_RU

/*** ACHTUNG! THIS FILE MUST BE ANSI! ***/

// Thanks: ElikaStudio

#include "glyph_cyr.h"

const char *STR_RU[] = { ""
// help
    , "Загрузка..."
    , "Нажмите H для помощи"
    , helpText
    , "%s@@@"
      "Уби{иств %d@@"
      "Предметов %d@@"
      "Секретов %d из %d@@"
      "Время %s"
    , "Сохранение игры..."
    , "Сохранение завершено!"
    , "ОШИБКА СОХРАНЕНИЯ!"
    , "ДА"
    , "НЕТ"
    , "Выкл"
    , "Вкл"
    , "Раздел~енны{и экран"
    , "VR"
    , "Низкое"
    , "Среднее"
    , "Высокое"
    , STR_LANGUAGES
    , "Применить"
    , "Ге{импад 1"
    , "Ге{импад 2"
    , "Ге{импад 3"
    , "Ге{импад 4"
    , "Не готов"
    , "Игрок 1"
    , "Игрок 2"
    , "Нажмите любую клавишу"
    , "%s - Выбрать"
    , "%s - Назад"
// inventory pages
    , "ОПЦИИ"
    , "ИНВЕНТАРЬ"
    , "Предметы"
// save game page
    , "Сохранить игру?"
    , "Текущая позиция"
// inventory option
    , "Игра"
    , "Карта"
    , "Компас"
    , "Статистика"
    , "Особняк Лары"
    , "Графика"
    , "Звук"
    , "Управление"
    , "Гамма"
// passport menu
    , "Загрузить игру"
    , "Новая игра"
    , "Перезапустить"
    , "Выход в меню"
    , "Вы{ити из игры"
    , "Выбор уровня"
// detail options
    , "Настро{ика графики"
    , "Фильтрация"
    , "Освещение"
    , "Тени"
    , "Вода"
    , "VSync"
    , "Стерео"
    , "Простые предметы"
// sound options
    , "Настро{ика звука"
    , "Реверберация"
    , "Субтитры"
    , "Язык"
// controls options
    , "Настро{ика управления"
    , "Клавиатура"
    , "Ге{импад"
    , "Вибрация"
    , "Автосмена цели"
    , "Множественные цели"
    // controls
    , "Влево", "Вправо", "Бег", "Назад", "Прыжок", "Шаг", "Де{иствие", "Оружие", "Смотреть", "Присесть", "Спринт", "Кувырок", "Инвентарь", "Start"
    // keys
    , "NONE", "LEFT", "RIGHT", "UP", "DOWN", "SPACE", "TAB", "ENTER", "ESCAPE", "SHIFT", "CTRL", "ALT"
    , "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
    , "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M"
    , "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"
    // gamepad
    , "NONE", "A", "B", "X", "Y", "L BUMPER", "R BUMPER", "SELECT", "START", "L STICK", "R STICK", "L TRIGGER", "R TRIGGER", "D-LEFT", "D-RIGHT", "D-UP", "D-DOWN"
// inventory items
    , "Неизвестно"
    , "Взрывчатка"
    , "Пистолеты"
    , "Дробовик"
    , "Магнумы"
    , "Узи"
    , "Обо{имы пистолетов"
    , "Патроны дробовика"
    , "Обо{имы магнумов"
    , "Обо{имы узи"
    , "Маленькая аптечка"
    , "Большая аптечка"
    , "Свинцовы{и слиток"
    , "Сцион"
// keys
    , "Ключ"
    , "Серебряны{и ключ"
    , "Ржавы{и ключ"
    , "Золото{и ключ"
    , "Сапфировы{и ключ"
    , "Ключ Нептуна"
    , "Ключ Атланта"
    , "Ключ Дамокла"
    , "Ключ Тора"
    , "Изысканны{и ключ"
// puzzles
    , "Элемент"
    , "Золото{и идол"
    , "Золото{и слиток"
    , "Шестерня"
    , "Предохранитель"
    , "Анкх"
    , "Глаз Гора"
    , "Печать Анубиса"
    , "Скарабе{и"
    , "Ключ пирамиды"
// TR1 subtitles
/* 22 */ ,
    "[04500]С возвращением!"
    "[06000]И тебя, пришла на торжественное открытие?"
    "[09500]Эволюция в тупике, естественны{и отбор нетороплив."
    "[13500]Появление свежего мяса пробудит территориальные распри."
    "[17500]Сделает нас сильнее и лучше."
    "[20500]Даже создаст новые виды!"
    "[22500]Что-то вроде эволюции на стероидах?"
    "[24500]Пинок под зад...@эти отсталые Тихокан и Квалопек не имели и понятия!"
    "[30000]Катаклизм Атлантиды скосил расу недоразвитых слабаков,"
    "[34000]заставил вернуться к самым основам выживания..."
    "[37000]Вс~е должно было быть не так."
    "[39000]И не так!"
    "[40000]Инкубация завершится через 15 секунд."
    "[43000]Слишком поздно поворачивать назад!"
    "[45000]Ты имеешь ввиду без вреда для операции?"
    "[47500]НЕЕЕТ!"
    "[50000]ДЕСЯТЬ..."
    "[54000]ПЯТЬ..."
    "[55500]ЧЕТЫРЕ... ТРИ... ДВА..."
    "[60000]ОДИН..."
/* 23 */ ,
    "[00001]Итак, ты полностью завладел моим вниманием"
    "[03000]Не уверена, что я завладела твоим."
    "[05500]Привет?"
    "[06500]Аэээ... вертел я тебя, знала бы ты где!"
    "[09000]Конечно"
    "[10000]Да, тебя и этот тупо{и кусок Сциона!"
    "[13500]Хочешь знать как? Я засуну тебе его ПРЯМО В..."
    "[17000]Стой! Мы говорим об артефакте?"
    "[19500]Ч~ерт ДА... ПРЯМО ТЕБЕ В..."
    "[22000]Погоди, и-извини."
    "[24000]Ты сказал, что это часть, где другие?"
    "[26500]Мисс Натла наняла для этого Пьера Дюпона."
    "[29500]И где же он?"
    "[30500]Ха! Тебе за ним не угнаться."
    "[34000]Думаешь, эти слова меня остановят?"
    "[37000]Я не знаю куда побежали его резвые лягушачьи лапки."
    "[42500]Лучше спроси об этом у мисс Натлы."
    "[46000]"
    "[51000]Спасибо. Спрошу."
/* 24 */ , ""
/* 25 */ ,
    "[03500]Здесь покоится Тихокан"
    "[06000]один из двух правителе{и Атлантиды..."
    "[10000]которы{и, даже после проклятия континента, попытался править здесь..."
    "[16000]в этих совсем других землях."
    "[19000]Он умер бездетным и его знания так и не обрели наследника."
    "[26000]Не суди нас строго, Тихокан."
/* 26 */ , "Добро пожаловать ко мне домо{и.@Я проведу небольшую экскурсию."
/* 27 */ , "Использу{ите стрелки,@чтобы идти в музыкальную комнату."
/* 28 */ , "Хорошо. Теперь немного акробатики.@Нажмите клавишу прыжка."
/* 29 */ , "Теперь снова нажмите прыжок и быстро нажмите одну из стрелок.@Я прыгну в одном из направлени{и."
/* 30 */ , "Это главны{и холл.@Прошу прощения за беспорядок,@много веще{и нужно перенести в хранилище,@но грузчики ещ~е не прибыли."
/* 31 */ , "Подо{идите к ящику и, продолжая нажимать клавишу впер~ед,@нажима{ите клавишу де{иствия,@тогда я залезу на ящик."
/* 32 */ , "Раньше это был бальны{и зал, но@я переделала его для заняти{и гимнастико{и.@Что скажете?@Что ж, сделаем пару упражнени{и."
/* 33 */ , "Я не всегда бегаю сломя голову.@Иногда требуется осторожно подо{ити к чему-нибудь.@Зажмите клавишу ходьбы и подо{идите к бело{и линии."
/* 34 */ , "С зажато{и клавише{и ходьбы я никуда упаду,@даже если вы будете неосторожны.@Дава{ите, попробу{ите."
/* 35 */ , "Если вы хотите осмотреться,@нажмите и держите клавишу смотреть,@затем нажмите клавишу нужного направления."
/* 36 */ , "Если я не могу допрыгнуть куда-либо,@я могу ухватиться за кра{и и уберечься от падения.@Идите к краю с бело{и линие{и до тех пор пока я не остановлюсь.@Затем нажмите прыжок и сразу же клавишу впер~ед.@Когда я окажусь в воздухе, нажмите и держите клавишу де{иствия."
/* 37 */ , "Нажмите клавишу впер~ед и я полезу наверх."
/* 38 */ , "Если нажать прыжок во время бега,@то я без проблем совершу такие прыжки."
/* 39 */ , "Идите к краю с бело{и линие{и, пока я не остановлюсь.@Затем пере{идя на шаг нажмите клавишу назад,@чтобы дать мне место для разбега.@Нажмите клавишу впер~ед и сразу нажмите и держите клавишу прыжка.@Я совершу прыжок в ту же секунду."
/* 40 */ , "Так, я теперь сложны{и трюк.@Сдела{ите как и прежде прыжок с разбега, а затем, пока я в воздухе,@нажмите клавишу де{иствия, чтобя я ухватилась за уступ."
/* 41 */ , "Отлично!"
/* 42 */ , "Попробуем туда забраться.@Нажмите клавишу впер~ед, а затем зажмите клавишу де{иствия."
/* 43 */ , "Мне туда не залезть, проход слишком узки{и.@Нажмите клавишу вправо и я пере{иду на руках на свободное место.@Затем нажмите впер~ед."
/* 44 */ , "Отлично!@Если уступ слишком высоки{и и при прыжке с него можно покалечиться,@я могу спуститься осторожно."
/* 45 */ , "Нажмите клавишу назад и я отпрыгну назад.@Сразу же нажмите и держите клавишу де{иствия,@тогда я не упаду, а ухвачусь за кра{и."
/* 46 */ , "Затем отпустите клавишу."
/* 47 */ , "А теперь поплаваем."
/* 48 */ , "Клавиша прыжка и стрелки изменяют мо~е направление@при плавании под водо{и."
/* 49 */ , "Ах! Э!@Использу{ите клавиши впер~ед, вправо и влево@для перемещения по поверхности воды.@Нажмите прыжок, чтобы нырнуть,@или плывите к краю и нажмите де{иствие,@чтобы вы{ити из воды."
/* 50 */ , "Хорошо. А теперь пора переодеться в сухую одежду."
/* 51 */ , "Скажи сыыыр!"
/* 52 */ , "Ничего личного."
/* 53 */ , "У меня вс~е ещ~е боль в голове после тебя.@И она подкидывает забавные идеи.@Например, пристрелить тебя к чертям!"
/* 54 */ , "Так просто от меня и моих выродков тебе не избавиться, Лара."
/* 55 */ , "Немного поздно для разадчи призов, но...@впрочем, тво~е участие ещ~е считается."
/* 56 */ , "Ты в меня стреляешь? Ты в меня стреляешь?! Тут больше никого, значит ты в меня стреляешь!"
// TR1 levels
    , "Особняк Лары"
    , "Пещеры"
    , "Город Вилкабамба"
    , "Затерянная Долина"
    , "Гробница Квалопека"
    , "Монастырь Св. Франциска"
    , "Колизе{и"
    , "Дворец Мидаса"
    , "Цистерна"
    , "Гробница Тихокана"
    , "Храм Камун"
    , "Обелиск Камун"
    , "Святилище Сциона"
    , "Раскопки Натлы"
    , "Атлантида"
    , "Великая Пирамида"
    , "Возвращение в Египет"
    , "Храм Кошки"
    , "Крепость Атлантиды"
    , "Уле{и"
// TR2 levels
    , "Lara's Home"
    , "The Great Wall"
    , "Venice"
    , "Bartoli's Hideout"
    , "Opera House"
    , "Offshore Rig"
    , "Diving Area"
    , "40 Fathoms"
    , "Wreck of the Maria Doria"
    , "Living Quarters"
    , "The Deck"
    , "Tibetan Foothills"
    , "Barkhang Monastery"
    , "Catacombs of the Talion"
    , "Ice Palace"
    , "Temple of Xian"
    , "Floating Islands"
    , "The Dragon's Lair"
    , "Home Sweet Home"
// TR3 levels
    , "Lara's House"
    , "Jungle"
    , "Temple Ruins"
    , "The River Ganges"
    , "Caves Of Kaliya"
    , "Coastal Village"
    , "Crash Site"
    , "Madubu Gorge"
    , "Temple Of Puna"
    , "Thames Wharf"
    , "Aldwych"
    , "Lud's Gate"
    , "City"
    , "Nevada Desert"
    , "High Security Compound"
    , "Area 51"
    , "Antarctica"
    , "RX-Tech Mines"
    , "Lost City Of Tinnos"
    , "Meteorite Cavern"
    , "All Hallows"
};

inline bool isCyrillic(char c) {
    return (c >= 'А' && c <= 'Я') || (c >= 'а' && c <= 'я');
}

inline char remapCyrillic(char c) {
    if (!isCyrillic(c)) {
        return c;
    }

    switch (c) {
        case 'а' : return 'a';
        case 'е' : return 'e';
        case 'ё' : return 'e';
        case 'и' : return 'u';
        case 'й' : return 'u';
        case 'о' : return 'o';
        case 'р' : return 'p';
        case 'с' : return 'c';
        case 'у' : return 'y';
        case 'х' : return 'x';
        case 'А' : return 'A';
        case 'В' : return 'B';
        case 'Е' : return 'E';
        case 'Ё' : return 'E';
        case 'К' : return 'K';
        case 'М' : return 'M';
        case 'Н' : return 'H';
        case 'О' : return 'O';
        case 'Р' : return 'P';
        case 'С' : return 'C';
        case 'Т' : return 'T';
        case 'Х' : return 'X';
    }
    return c;
}

#endif
